In [48]:
import pandas as pd
import numpy as np

data = {
    "Name" : ['Rahul', 'Priya', 'Riya', '-'],
    "Gender" : ["Male", "F", "female", "Male"],
    "Age" : [18, 19, 18, 20],
    "Marks": [88, np.nan, 76, 54],
    "City" : ['Bangalore', 'Mumbai', 'Delhi', 'Banglore'],
    "Attendence": [92, 85, np.nan, 90]
}
df = pd.DataFrame(data)
df

    Name  Gender  Age  Marks       City  Attendence
0  Rahul    Male   18   88.0  Bangalore        92.0
1  Priya       F   19    NaN     Mumbai        85.0
2   Riya  female   18   76.0      Delhi         NaN
3      -    Male   20   54.0   Banglore        90.0

In [49]:
df.isnull().sum()

Name          0
Gender        0
Age           0
Marks         1
City          0
Attendence    1
dtype: int64

In [50]:
val = df.Marks.median()

In [51]:
df.Marks.fillna(val, inplace=True)

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\2920425538.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Marks.fillna(val, inplace=True)

In [52]:
df

    Name  Gender  Age  Marks       City  Attendence
0  Rahul    Male   18   88.0  Bangalore        92.0
1  Priya       F   19   76.0     Mumbai        85.0
2   Riya  female   18   76.0      Delhi         NaN
3      -    Male   20   54.0   Banglore        90.0

In [53]:
val = df.Attendence.mean()
df.Attendence.fillna(val, inplace=True)

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\4020902187.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.Attendence.fillna(val, inplace=True)

In [54]:
df

    Name  Gender  Age  Marks       City  Attendence
0  Rahul    Male   18   88.0  Bangalore        92.0
1  Priya       F   19   76.0     Mumbai        85.0
2   Riya  female   18   76.0      Delhi        89.0
3      -    Male   20   54.0   Banglore        90.0

In [55]:
df.Gender = df.Gender.str.lower().replace({'f':'female', 'm':'male'})

In [56]:
df

    Name  Gender  Age  Marks       City  Attendence
0  Rahul    male   18   88.0  Bangalore        92.0
1  Priya  female   19   76.0     Mumbai        85.0
2   Riya  female   18   76.0      Delhi        89.0
3      -    male   20   54.0   Banglore        90.0

In [57]:
df.City = df.City.replace({'Banglore': 'Bangalore'})

In [58]:
df

    Name  Gender  Age  Marks       City  Attendence
0  Rahul    male   18   88.0  Bangalore        92.0
1  Priya  female   19   76.0     Mumbai        85.0
2   Riya  female   18   76.0      Delhi        89.0
3      -    male   20   54.0  Bangalore        90.0

In [59]:
df[df.Name != '-']

    Name  Gender  Age  Marks       City  Attendence
0  Rahul    male   18   88.0  Bangalore        92.0
1  Priya  female   19   76.0     Mumbai        85.0
2   Riya  female   18   76.0      Delhi        89.0

In [117]:
import seaborn as sns
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [118]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [119]:
df.age.dropna()

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
885    39.0
886    27.0
887    19.0
889    26.0
890    32.0
Name: age, Length: 714, dtype: float64

In [120]:
df.age.mean()

np.float64(29.69911764705882)

In [121]:
df.age.median()

np.float64(28.0)

In [122]:
df.age.mode()

0    24.0
Name: age, dtype: float64

In [123]:
df.age.fillna(0)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [124]:
val = df.age.median()
df.age.fillna(val, inplace=True);

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\2263725143.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.age.fillna(val, inplace=True);

In [125]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [126]:
val = df.embarked.mode()[0]
df.embarked.fillna(val, inplace=True);

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\2509643443.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.embarked.fillna(val, inplace=True);

In [127]:
df.isna().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         0
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [128]:
df.deck.fillna(method='ffill')

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\2686812009.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.deck.fillna(method='ffill')

0      NaN
1        C
2        C
3        C
4        C
      ...
886      C
887      B
888      B
889      C
890      C
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [129]:
df.deck

0      NaN
1        C
2      NaN
3        C
4      NaN
      ...
886    NaN
887      B
888    NaN
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [130]:
df.deck.fillna(method='bfill')

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\4168024181.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.deck.fillna(method='bfill')

0        C
1        C
2        C
3        C
4        E
      ...
886      B
887      B
888      C
889      C
890    NaN
Name: deck, Length: 891, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [131]:
val = df.deck.mode()[0]
df.deck.fillna(val, inplace=True);

In [132]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [133]:
val = df.embark_town.mode()[0]
df.embark_town.fillna(val, inplace=True);

C:\Users\visha\AppData\Local\Temp\ipykernel_27148\2040236919.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df.embark_town.fillna(val, inplace=True);

In [134]:
from sklearn.impute import KNNImputer
imputer = KNNImputer()
imputer.fit_transform(df[['age']])

array([[22.  ],
       [38.  ],
       [26.  ],
       [35.  ],
       [35.  ],
       [28.  ],
       [54.  ],
       [ 2.  ],
       [27.  ],
       [14.  ],
       [ 4.  ],
       [58.  ],
       [20.  ],
       [39.  ],
       [14.  ],
       [55.  ],
       [ 2.  ],
       [28.  ],
       [31.  ],
       [28.  ],
       [35.  ],
       [34.  ],
       [15.  ],
       [28.  ],
       [ 8.  ],
       [38.  ],
       [28.  ],
       [19.  ],
       [28.  ],
       [28.  ],
       [40.  ],
       [28.  ],
       [28.  ],
       [66.  ],
       [28.  ],
       [42.  ],
       [28.  ],
       [21.  ],
       [18.  ],
       [14.  ],
       [40.  ],
       [27.  ],
       [28.  ],
       [ 3.  ],
       [19.  ],
       [28.  ],
       [28.  ],
       [28.  ],
       [28.  ],
       [18.  ],
       [ 7.  ],
       [21.  ],
       [49.  ],
       [29.  ],
       [65.  ],
       [28.  ],
       [21.  ],
       [28.5 ],
       [ 5.  ],
       [11.  ],
       [22.  ],
       [38.  ],
       [45.  ],
       [ 4.  ],
       [28.  ],
       [28.  ],
       [29.  ],
       [19.  ],
       [17.  ],
       [26.  ],
       [32.  ],
       [16.  ],
       [21.  ],
       [26.  ],
       [32.  ],
       [25.  ],
       [28.  ],
       [28.  ],
       [ 0.83],
       [30.  ],
       [22.  ],
       [29.  ],
       [28.  ],
       [28.  ],
       [17.  ],
       [33.  ],
       [16.  ],
       [28.  ],
       [23.  ],
       [24.  ],
       [29.  ],
       [20.  ],
       [46.  ],
       [26.  ],
       [59.  ],
       [28.  ],
       [71.  ],
       [23.  ],
       [34.  ],
       [34.  ],
       [28.  ],
       [28.  ],
       [21.  ],
       [33.  ],
       [37.  ],
       [28.  ],
       [21.  ],
       [28.  ],
       [38.  ],
       [28.  ],
       [47.  ],
       [14.5 ],
       [22.  ],
       [20.  ],
       [17.  ],
       [21.  ],
       [70.5 ],
       [29.  ],
       [24.  ],
       [ 2.  ],
       [21.  ],
       [28.  ],
       [32.5 ],
       [32.5 ],
       [54.  ],
       [12.  ],
       [28.  ],
       [24.  ],
       [28.  ],
       [45.  ],
       [33.  ],
       [20.  ],
       [47.  ],
       [29.  ],
       [25.  ],
       [23.  ],
       [19.  ],
       [37.  ],
       [16.  ],
       [24.  ],
       [28.  ],
       [22.  ],
       [24.  ],
       [19.  ],
       [18.  ],
       [19.  ],
       [27.  ],
       [ 9.  ],
       [36.5 ],
       [42.  ],
       [51.  ],
       [22.  ],
       [55.5 ],
       [40.5 ],
       [28.  ],
       [51.  ],
       [16.  ],
       [30.  ],
       [28.  ],
       [28.  ],
       [44.  ],
       [40.  ],
       [26.  ],
       [17.  ],
       [ 1.  ],
       [ 9.  ],
       [28.  ],
       [45.  ],
       [28.  ],
       [28.  ],
       [61.  ],
       [ 4.  ],
       [ 1.  ],
       [21.  ],
       [56.  ],
       [18.  ],
       [28.  ],
       [50.  ],
       [30.  ],
       [36.  ],
       [28.  ],
       [28.  ],
       [ 9.  ],
       [ 1.  ],
       [ 4.  ],
       [28.  ],
       [28.  ],
       [45.  ],
       [40.  ],
       [36.  ],
       [32.  ],
       [19.  ],
       [19.  ],
       [ 3.  ],
       [44.  ],
       [58.  ],
       [28.  ],
       [42.  ],
       [28.  ],
       [24.  ],
       [28.  ],
       [28.  ],
       [34.  ],
       [45.5 ],
       [18.  ],
       [ 2.  ],
       [32.  ],
       [26.  ],
       [16.  ],
       [40.  ],
       [24.  ],
       [35.  ],
       [22.  ],
       [30.  ],
       [28.  ],
       [31.  ],
       [27.  ],
       [42.  ],
       [32.  ],
       [30.  ],
       [16.  ],
       [27.  ],
       [51.  ],
       [28.  ],
       [38.  ],
       [22.  ],
       [19.  ],
       [20.5 ],
       [18.  ],
       [28.  ],
       [35.  ],
       [29.  ],
       [59.  ],
       [ 5.  ],
       [24.  ],
       [28.  ],
       [44.  ],
       [ 8.  ],
       [19.  ],
       [33.  ],
       [28.  ],
       [28.  ],
       [29.  ],
       [22.  ],
       [30.  ],
       [44.  ],
       [25.  ],
       [24.  ],
       [37.  ],
       [54.  ],
       [28.  ],
       [29.  ],
       [62.  ],
       [30.  ],
       [41.  ],
       [29.  ],
       [28.  ],
       [30.  ],
       [35.  ],
       [50.  ],
       [28.  ],
       [ 3.  ],
       [52.  ],
       [40.  ],
       [28.  ],
       [36.  ],
       [16.  ],
       [25.  ],
       [58.  ],
       [35.  ],
       [28.  ],
       [25.  ],
       [41.  ],
       [37.  ],
       [28.  ],
       [63.  ],
       [45.  ],
       [28.  ],
       [ 7.  ],
       [35.  ],
       [65.  ],
       [28.  ],
       [16.  ],
       [19.  ],
       [28.  ],
       [33.  ],
       [30.  ],
       [22.  ],
       [42.  ],
       [22.  ],
       [26.  ],
       [19.  ],
       [36.  ],
       [24.  ],
       [24.  ],
       [28.  ],
       [23.5 ],
       [ 2.  ],
       [28.  ],
       [50.  ],
       [28.  ],
       [28.  ],
       [19.  ],
       [28.  ],
       [28.  ],
       [ 0.92],
       [28.  ],
       [17.  ],
       [30.  ],
       [30.  ],
       [24.  ],
       [18.  ],
       [26.  ],
       [28.  ],
       [43.  ],
       [26.  ],
       [24.  ],
       [54.  ],
       [31.  ],
       [40.  ],
       [22.  ],
       [27.  ],
       [30.  ],
       [22.  ],
       [28.  ],
       [36.  ],
       [61.  ],
       [36.  ],
       [31.  ],
       [16.  ],
       [28.  ],
       [45.5 ],
       [38.  ],
       [16.  ],
       [28.  ],
       [28.  ],
       [29.  ],
       [41.  ],
       [45.  ],
       [45.  ],
       [ 2.  ],
       [24.  ],
       [28.  ],
       [25.  ],
       [36.  ],
       [24.  ],
       [40.  ],
       [28.  ],
       [ 3.  ],
       [42.  ],
       [23.  ],
       [28.  ],
       [15.  ],
       [25.  ],
       [28.  ],
       [28.  ],
       [22.  ],
       [38.  ],
       [28.  ],
       [28.  ],
       [40.  ],
       [29.  ],
       [45.  ],
       [35.  ],
       [28.  ],
       [30.  ],
       [60.  ],
       [28.  ],
       [28.  ],
       [24.  ],
       [25.  ],
       [18.  ],
       [19.  ],
       [22.  ],
       [ 3.  ],
       [28.  ],
       [22.  ],
       [27.  ],
       [20.  ],
       [19.  ],
       [42.  ],
       [ 1.  ],
       [32.  ],
       [35.  ],
       [28.  ],
       [18.  ],
       [ 1.  ],
       [36.  ],
       [28.  ],
       [17.  ],
       [36.  ],
       [21.  ],
       [28.  ],
       [23.  ],
       [24.  ],
       [22.  ],
       [31.  ],
       [46.  ],
       [23.  ],
       [28.  ],
       [39.  ],
       [26.  ],
       [21.  ],
       [28.  ],
       [20.  ],
       [34.  ],
       [51.  ],
       [ 3.  ],
       [21.  ],
       [28.  ],
       [28.  ],
       [28.  ],
       [33.  ],
       [28.  ],
       [44.  ],
       [28.  ],
       [34.  ],
       [18.  ],
       [30.  ],
       [10.  ],
       [28.  ],
       [21.  ],
       [29.  ],
       [28.  ],
       [18.  ],
       [28.  ],
       [28.  ],
       [19.  ],
       [28.  ],
       [32.  ],
       [28.  ],
       [28.  ],
       [42.  ],
       [17.  ],
       [50.  ],
       [14.  ],
       [21.  ],
       [24.  ],
       [64.  ],
       [31.  ],
       [45.  ],
       [20.  ],
       [25.  ],
       [28.  ],
       [28.  ],
       [ 4.  ],
       [13.  ],
       [34.  ],
       [ 5.  ],
       [52.  ],
       [36.  ],
       [28.  ],
       [30.  ],
       [49.  ],
       [28.  ],
       [29.  ],
       [65.  ],
       [28.  ],
       [50.  ],
       [28.  ],
       [48.  ],
       [34.  ],
       [47.  ],
       [48.  ],
       [28.  ],
       [38.  ],
       [28.  ],
       [56.  ],
       [28.  ],
       [ 0.75],
       [28.  ],
       [38.  ],
       [33.  ],
       [23.  ],
       [22.  ],
       [28.  ],
       [34.  ],
       [29.  ],
       [22.  ],
       [ 2.  ],
       [ 9.  ],
       [28.  ],
       [50.  ],
       [63.  ],
       [25.  ],
       [28.  ],
       [35.  ],
       [58.  ],
       [30.  ],
       [ 9.  ],
       [28.  ],
       [21.  ],
       [55.  ],
       [71.  ],
       [21.  ],
       [28.  ],
       [54.  ],
       [28.  ],
       [25.  ],
       [24.  ],
       [17.  ],
       [21.  ],
       [28.  ],
       [37.  ],
       [16.  ],
       [18.  ],
       [33.  ],
       [28.  ],
       [28.  ],
       [26.  ],
       [29.  ],
       [28.  ],
       [36.  ],
       [54.  ],
       [24.  ],
       [47.  ],
       [34.  ],
       [28.  ],
       [36.  ],
       [32.  ],
       [30.  ],
       [22.  ],
       [28.  ],
       [44.  ],
       [28.  ],
       [40.5 ],
       [50.  ],
       [28.  ],
       [39.  ],
       [23.  ],
       [ 2.  ],
       [28.  ],
       [17.  ],
       [28.  ],
       [30.  ],
       [ 7.  ],
       [45.  ],
       [30.  ],
       [28.  ],
       [22.  ],
       [36.  ],
       [ 9.  ],
       [11.  ],
       [32.  ],
       [50.  ],
       [64.  ],
       [19.  ],
       [28.  ],
       [33.  ],
       [ 8.  ],
       [17.  ],
       [27.  ],
       [28.  ],
       [22.  ],
       [22.  ],
       [62.  ],
       [48.  ],
       [28.  ],
       [39.  ],
       [36.  ],
       [28.  ],
       [40.  ],
       [28.  ],
       [28.  ],
       [28.  ],
       [24.  ],
       [19.  ],
       [29.  ],
       [28.  ],
       [32.  ],
       [62.  ],
       [53.  ],
       [36.  ],
       [28.  ],
       [16.  ],
       [19.  ],
       [34.  ],
       [39.  ],
       [28.  ],
       [32.  ],
       [25.  ],
       [39.  ],
       [54.  ],
       [36.  ],
       [28.  ],
       [18.  ],
       [47.  ],
       [60.  ],
       [22.  ],
       [28.  ],
       [35.  ],
       [52.  ],
       [47.  ],
       [28.  ],
       [37.  ],
       [36.  ],
       [28.  ],
       [49.  ],
       [28.  ],
       [49.  ],
       [24.  ],
       [28.  ],
       [28.  ],
       [44.  ],
       [35.  ],
       [36.  ],
       [30.  ],
       [27.  ],
       [22.  ],
       [40.  ],
       [39.  ],
       [28.  ],
       [28.  ],
       [28.  ],
       [35.  ],
       [24.  ],
       [34.  ],
       [26.  ],
       [ 4.  ],
       [26.  ],
       [27.  ],
       [42.  ],
       [20.  ],
       [21.  ],
       [21.  ],
       [61.  ],
       [57.  ],
       [21.  ],
       [26.  ],
       [28.  ],
       [80.  ],
       [51.  ],
       [32.  ],
       [28.  ],
       [ 9.  ],
       [28.  ],
       [32.  ],
       [31.  ],
       [41.  ],
       [28.  ],
       [20.  ],
       [24.  ],
       [ 2.  ],
       [28.  ],
       [ 0.75],
       [48.  ],
       [19.  ],
       [56.  ],
       [28.  ],
       [23.  ],
       [28.  ],
       [18.  ],
       [21.  ],
       [28.  ],
       [18.  ],
       [24.  ],
       [28.  ],
       [32.  ],
       [23.  ],
       [58.  ],
       [50.  ],
       [40.  ],
       [47.  ],
       [36.  ],
       [20.  ],
       [32.  ],
       [25.  ],
       [28.  ],
       [43.  ],
       [28.  ],
       [40.  ],
       [31.  ],
       [70.  ],
       [31.  ],
       [28.  ],
       [18.  ],
       [24.5 ],
       [18.  ],
       [43.  ],
       [36.  ],
       [28.  ],
       [27.  ],
       [20.  ],
       [14.  ],
       [60.  ],
       [25.  ],
       [14.  ],
       [19.  ],
       [18.  ],
       [15.  ],
       [31.  ],
       [ 4.  ],
       [28.  ],
       [25.  ],
       [60.  ],
       [52.  ],
       [44.  ],
       [28.  ],
       [49.  ],
       [42.  ],
       [18.  ],
       [35.  ],
       [18.  ],
       [25.  ],
       [26.  ],
       [39.  ],
       [45.  ],
       [42.  ],
       [22.  ],
       [28.  ],
       [24.  ],
       [28.  ],
       [48.  ],
       [29.  ],
       [52.  ],
       [19.  ],
       [38.  ],
       [27.  ],
       [28.  ],
       [33.  ],
       [ 6.  ],
       [17.  ],
       [34.  ],
       [50.  ],
       [27.  ],
       [20.  ],
       [30.  ],
       [28.  ],
       [25.  ],
       [25.  ],
       [29.  ],
       [11.  ],
       [28.  ],
       [23.  ],
       [23.  ],
       [28.5 ],
       [48.  ],
       [35.  ],
       [28.  ],
       [28.  ],
       [28.  ],
       [36.  ],
       [21.  ],
       [24.  ],
       [31.  ],
       [70.  ],
       [16.  ],
       [30.  ],
       [19.  ],
       [31.  ],
       [ 4.  ],
       [ 6.  ],
       [33.  ],
       [23.  ],
       [48.  ],
       [ 0.67],
       [28.  ],
       [18.  ],
       [34.  ],
       [33.  ],
       [28.  ],
       [41.  ],
       [20.  ],
       [36.  ],
       [16.  ],
       [51.  ],
       [28.  ],
       [30.5 ],
       [28.  ],
       [32.  ],
       [24.  ],
       [48.  ],
       [57.  ],
       [28.  ],
       [54.  ],
       [18.  ],
       [28.  ],
       [ 5.  ],
       [28.  ],
       [43.  ],
       [13.  ],
       [17.  ],
       [29.  ],
       [28.  ],
       [25.  ],
       [25.  ],
       [18.  ],
       [ 8.  ],
       [ 1.  ],
       [46.  ],
       [28.  ],
       [16.  ],
       [28.  ],
       [28.  ],
       [25.  ],
       [39.  ],
       [49.  ],
       [31.  ],
       [30.  ],
       [30.  ],
       [34.  ],
       [31.  ],
       [11.  ],
       [ 0.42],
       [27.  ],
       [31.  ],
       [39.  ],
       [18.  ],
       [39.  ],
       [33.  ],
       [26.  ],
       [39.  ],
       [35.  ],
       [ 6.  ],
       [30.5 ],
       [28.  ],
       [23.  ],
       [31.  ],
       [43.  ],
       [10.  ],
       [52.  ],
       [27.  ],
       [38.  ],
       [27.  ],
       [ 2.  ],
       [28.  ],
       [28.  ],
       [ 1.  ],
       [28.  ],
       [62.  ],
       [15.  ],
       [ 0.83],
       [28.  ],
       [23.  ],
       [18.  ],
       [39.  ],
       [21.  ],
       [28.  ],
       [32.  ],
       [28.  ],
       [20.  ],
       [16.  ],
       [30.  ],
       [34.5 ],
       [17.  ],
       [42.  ],
       [28.  ],
       [35.  ],
       [28.  ],
       [28.  ],
       [ 4.  ],
       [74.  ],
       [ 9.  ],
       [16.  ],
       [44.  ],
       [18.  ],
       [45.  ],
       [51.  ],
       [24.  ],
       [28.  ],
       [41.  ],
       [21.  ],
       [48.  ],
       [28.  ],
       [24.  ],
       [42.  ],
       [27.  ],
       [31.  ],
       [28.  ],
       [ 4.  ],
       [26.  ],
       [47.  ],
       [33.  ],
       [47.  ],
       [28.  ],
       [15.  ],
       [20.  ],
       [19.  ],
       [28.  ],
       [56.  ],
       [25.  ],
       [33.  ],
       [22.  ],
       [28.  ],
       [25.  ],
       [39.  ],
       [27.  ],
       [19.  ],
       [28.  ],
       [26.  ],
       [32.  ]])

In [135]:
df.embark_town

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [136]:
df.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [137]:
df.duplicated().sum()

np.int64(112)

In [138]:
df.drop_duplicates(inplace=True)

In [139]:
df.duplicated().sum()

np.int64(0)

In [140]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,C,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,28.0,1,2,23.4500,S,Third,woman,False,C,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,C,Queenstown,no,True

In [105]:
df.deck.unique()

['C', 'E', 'G', 'D', 'A', 'B', 'F']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [106]:
data = {
    "Name": ['Raj', 'Priya', 'Arjun', 'Neha'],
    "Gender": ['Male', 'Female', 'Male', 'Female'],
    "Department" : ['HR', 'IT', 'Finance', 'HR'],
    "Salary": [45000, 60000, 52000, 47000]
}

df = pd.DataFrame(data)
df

    Name  Gender Department  Salary
0    Raj    Male         HR   45000
1  Priya  Female         IT   60000
2  Arjun    Male    Finance   52000
3   Neha  Female         HR   47000

In [108]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df.Gender = le.fit_transform(df.Gender)

In [109]:
df

    Name  Gender Department  Salary
0    Raj       1         HR   45000
1  Priya       0         IT   60000
2  Arjun       1    Finance   52000
3   Neha       0         HR   47000

In [110]:
le.fit_transform(df.Department)

array([1, 2, 0, 1])

In [112]:
df

    Name  Gender Department  Salary
0    Raj       1         HR   45000
1  Priya       0         IT   60000
2  Arjun       1    Finance   52000
3   Neha       0         HR   47000

In [114]:
df = pd.get_dummies(df, columns=['Department'], dtype=int)
df

    Name  Gender  Salary  Department_Finance  Department_HR  Department_IT
0    Raj       1   45000                   0              1              0
1  Priya       0   60000                   0              0              1
2  Arjun       1   52000                   1              0              0
3   Neha       0   47000                   0              1              0

In [115]:
df.drop(['Name'], axis=1, inplace=True)

In [116]:
df

   Gender  Salary  Department_Finance  Department_HR  Department_IT
0       1   45000                   0              1              0
1       0   60000                   0              0              1
2       1   52000                   1              0              0
3       0   47000                   0              1              0

In [141]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,C,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,C,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,28.0,1,2,23.4500,S,Third,woman,False,C,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,C,Queenstown,no,True

In [146]:
df.fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
885    29.1250
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 779, dtype: float64

In [147]:
df['fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
885    29.1250
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 779, dtype: float64

In [150]:
df['class']

0      Third
1      First
2      Third
3      First
4      Third
       ...
885    Third
887    First
888    Third
889    First
890    Third
Name: class, Length: 779, dtype: category
Categories (3, object): ['First', 'Second', 'Third']

In [ ]:
from sklearn.preprocessing import OrdinalEncoder
en = OrdinalEncoder()
df['class'] = en.fit_transform(df[['class']])

In [153]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,2.0,man,True,C,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,0.0,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,2.0,woman,False,C,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,0.0,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,2.0,man,True,C,Southampton,no,True